#ifndef __tree__
#define __tree__

//------------------------------------------------------------------------------
// tree.h - содержит описание дерева
//------------------------------------------------------------------------------

#include <fstream>
using namespace std;

#include "rnd.h"
#include "stringHelper.h"
//------------------------------------------------------------------------------
// дерево
struct tree {
	string name;
	long age;
};

// Ввод параметров дерева из файла
void In(tree& t, ifstream& ifst);

// Случайный ввод параметров дерева
void InRnd(tree& е);

// Вывод параметров дерева в форматируемый поток
void Out(tree& t, ofstream& ofst);

// Получение частного от деления числа гласных букв в названии на общую длину названия
double GetPartOfVowels(tree& t);

#endif //__tree__
